laRhea BL
                          laRhea BL
Speed Mix                 laRhea V+
                          Helyezze be
a poharat               bekapcsolás...
Kérem várjon         Eloválasztás
-   Cukor    +         Helyezze be
a poharat               Itala elkészult
Kérem vegye el      elkészítés
ital nr. §1              §1
elkészítés                       Kérem dobja be a
pontos összeget    Ellenorizze a
fozoegységet          Programozás
OK                      Programozás
során hiba              1= BILL---> VMC
2= VMC ---> BILL    Programozás
EPROM adatok            Programozás-----
RHEA FLASH------   kevés a termék
§1                   VÍZSZŰRO
TISZTÍT.10=START           Az automata
uzemkész                Szerviz
kártya                      letiltva
----------------           Reset
kávézaccot=RESET              Reset
kávézaccot = P1                
                                  Hitel:
§1                           Uzemen kívul
vízlágyító             Uzemen kívul
fozoe. tisztítás       érték :    §1
                      Uzemen kívul
kávézacc urítés        nincs termék
                       víz újratöltés
várjon               várjon
                             várjon
homérséklet                  ÜZEMEN KÍVÜL
KI §1 §2               gép kikapcsolás
§1:§2               ................
kezdés:    §1:§2   Teszt ital
                         Élvezze kedvenc
italát nálunk       Nagyszerű kávé
pillanatok alatt     messaggio 3
programmabile           Igyon egy
Nagyszerű kávét           Nagyszerű kávé
várakozás nélkul     Dobja be a
helyes összeget          h. inst.     §1
----------------    h.f§1  h.g  §2
h.h §3               Kártyaolvasó
nincs kapcsolat         
- Adatlehívás -                   K A N N A
                          rheavendors
                        Helyezze be
a poharat               nincs választás
Tej      OFF §1     HAPPY
HOUR                          Ingyen ital
§1                      nincs kávébab
OFF  §1               uz. 48
                             Uzemen kvul
nincs víz               töltsön vizet és
nyomja -1- gomb    Hydrodynamic
Emptying phase         automata
goztisztítás               Szerviz
                            hiba on KEY
kód   §1                1-4=Mix 5=MilkMd
7=Gr 8=BC 9=Desc   1-4=öblítés
7=Gr 8=BC 9=Desc        1-4=Rinse 5=Milk
7=grinder 8=BC     1-4=Rinse
8=BC                      1-4=öblítés
                        öblítés   §1
§2                     RFID olvasó
kapcsolódva             Hello      §1
§2-§3-§4 §5 §6:§7     Dobja be a
pontos összeget          Cseréljen
vízlágyítót               Tisztítsa ki
a fozoegységet         Távolítsa el
a kávézaccot           TERMÉK BEÁLLÍTÁS
---- OK ----       TELEPÍTÉS
                          vége
telepítés                      hitel = 0
                          Helyezze be
a kártyát               Kártya
kiválasztás                  kevés a termék
TÖLTSÖN BE KÁVÉT     Nem elérheto
§1                     -   CUKOR    +
                     Válasszon
italt                     door  module
verzió  §1             espresso modul
verzió  §1           Tejmodul
version    §1              hideg modul
verzió  §1               
OFF §1  §2                        Kérem vegye el
a poharat            Bojler töltés
kérem várjon          érvénytelen vevo
kártya kód         érvénytelen gép
kártya kód          A következo ital
ingyenes           ZSETON
                             Felfűtés
kérem várjon               Érték :    §1
Hitel : §2            First coffee
in progress            Távolítsa el
a kávézaccot           Távolítsa el
a csepptálcát          Helyezze be
a csepptálcát           gozös átmosás
10=START              mosó-szerrel
töltése 10=START       filling water...
conduc.=§1 uS      víz töltése
10=START                melegvíz
öblítés 10=START           Tejmodul
bekapcsolás...             Tejtartály
ures                     S T O P
                            Rfid Kártya
Zárolt                  Kérem tisztítsa
ki a tejmodult      tisztítsa mosó-
szerrel 10=Rajt     Cyclic Test
round #§1               Cyclic Test
Stopped!!!              öblítés hideg-
vízzel  10=START     END Cleaning
with Detergent         VÉGE
gozös átmosás                  Tejmodul
tisztítás                  Helyezzen be
poharat                Hangolás
Kérem várjon               §1
HOT WATER                        Warning products
level   low         
                                  Vegye el a kávét
Nyomja meg: PROG    
automatik. reset                  Vége
eltávolítás                    Final Result:§1
KEY PRESS <PROG>    A fejő öblítési
ideje frissítve     TESZT FUT
                          részl. nyugtázás
reset lenyom P10   Starting Test
4=start PROG=end      TEST MOTOR - §1
sx §2  dx §3        TEST - §1  Tp: §2
up §3  dn §4      Final Result
TEST - §1              System halted
Please restart!       Empty the waste
liquid tank         Insert the waste
liquid tank        rinsing §1   §2
........uS=§3       Have you done
checks?>START/10      Clean.Deter.type
10=Tab 12=Liquid   check milk
                         Check Detergent
of the water mix    Milk Mod.Clean.:
check deter. §1    Cleaning §1  §2
........uS=§3       Dissolving
Detergent §1 §2          Insert the milk
tube.10:now 9:no    Ins. Tube/refill
Milk 10:now 9:no   check milk
presence                 check milk
quality                  check milk and
make cleaning        Gest. rhMM1.v+ ?
B1=Enable B2=no    Clean. rhMM1.v+
Time §1:§2 Ok=P1    Milk Mod.Clean.:
low deterg. §1     check tank cold
milk temperature    Available
                          Close  Coffee
KEY PRESS <PROG>      Open   Coffee
KEY PRESS <PROG>      1/13 Clean Grin.
1=Grin1; 2=Grin2   2/13 G§1 Close
shutter.  10=ok      3/13 Rem. brewer
& bean hop 10=ok   4/13 Inst. clean
device.    10=ok   5/13 Grinder
clean   10=start       Cycle §1 of §2
                     6/13 Rep. Clean
10=Yes; other=NO    7/13 Ref. Clean
device.    10=ok    8/13 Put back
bean hop.  10=ok      9/13 Open hopp.
shutter.  10=ok     10/13 Coffee
grind.  10=Start       Cycle §1 of §2
timeout §3 sec       11/13 Rep. Proc.
10=Yes; other=NO   12/13 Put back
Brewer.  10 = ok     13/13 Coffee?
10=Yes; other=NO      ESPRESSO
preparing                  Forthcoming
sched maintenan.        Maintenance must
be performed       Enter Weight
1 = Save  §1           Itala elkészult
Kérem vegye el      Uzemen kvul
nincs víz               Place your cup
and close flap       Távolítsa el
a csepptálcát          Helyezze be
a csepptálcát           Please close the
flap               Kérem tisztítsa
ki a tejmodult      Helyezze be
a poharat               Kérem dobja be a
pontos összeget    Ellenorizze a
fozoegységet          Uzemen kívul
fozoe. tisztítás       ................
kezdés:    §1:§2   Teszt ital
                         Élvezze kedvenc
italát nálunk       Nagyszerű kávé
pillanatok alatt     messaggio 3
programmabile           Igyon egy
Nagyszerű kávét           Nagyszerű kávé
várakozás nélkul     Dobja be a
helyes összeget          Tisztítsa ki
a fozoegységet         Távolítsa el
a kávézaccot           END PROGRAMMING
wait..........      access code
INHIBITED               uninstallation
in progress...        
                                  CALIBRATION IS
NOT POSSIBLE         Remove Brewer
Push PROG button      Replace Brewer
Push PROG Button     Open boiler tap
10=start            KEY PRESS
>PROG<                    end uninstall
close boiler tap      Water supply
conn.? Start=10        driptray
inside? 10=START           driptray
inside? 10=START           remove coffee
grounds 10=START      Drip tray
empty? Start=10           REGISTRATION out
of service         REGISTRATION out
of service         PROGRAMMING-----
----------------   Preselection
not used               PRODUCT  §1
0=inhib.    §2.§3       coffee time
grinder §1   §2.§3      coffee time
grinder     §1.§2       Ent. Weight §1
1=Save  2=Repeat     Ent. ML of water
1=Save 2=rep §1    Empties test jug
Test:  1=ok 2=no   Fill H2O FM tank
t.tube 1=ok 2=no   Confirm Action
10=YES      9=NO     1-4=Mix 5=MilkMd
8=BC 9=Desc        1-4=öblítés
8=BC 9=Desc             1-4=Rinse 5=Milk
8=BC               1-4=öblítés
7=grinder 8=BC          1-4=Mx M:5=C 6=D
7=Gr 8=BC 9=Desc   1-4=Mix 5=MilkMd
6=DeM 8=BC 9=Des   1-4=Mix 5=MilkMd
6=D.M 7=Gr. 8=BC   1-4=Mix 5=MilkMd
6=Desc.Milk 8=BC   ENERGIATAK.
                        Hitel:
Hitelkártya                  Kérjük mutassa
be a kártyát         Daráló kalib.
szükséges             Refill   cups
                      Use own cups
                       